 /// 修复下面代码的错误并尽可能少的修改
 /// 结论:只要变量被声明但未初始化，并且没有被使用，就不会导致编译错误。只有在使用未初始化变量时才会出现错误。
fn practice1() {
    let x: i32 = 0; // 初始化
    let y: i32; // 未初始化，也未被使用
    println!("x is equal to {}", x); 
}

//------------------------------------------------------------------------------------

/// 完形填空，让代码编译
/// 结论: mut添加可变性
fn practice2() {
    let mut __ = 1;
    __ += 2; 
    
    // println!("x = {}", x); 
    println!("x = {}", __); 
}
//------------------------------------------------------------------------------------

/// 修复下面代码的错误并使用尽可能少的改变
/// 结论: 变量的作用域是由花括号 {} 定义的，在花括号内声明的变量只能在该花括号内使用，花括号外无法访问。
fn practice3() {
    let x: i32 = 10;
    let y: i32 = 5;
    {
        println!("x 的值是 {}, y 的值是 {}", x, y);
    }
    println!("x 的值是 {}, y 的值是 {}", x, y); 
}
//------------------------------------------------------------------------------------

/// 修复错误
/// fn main() {
///     println!("{}, world", x); 
/// }
/// 
/// fn define_x() {
///     let x = "hello";
/// }
/// 结论: 变量 x 的作用域仅限于 define_x 函数内部，无法在 main 函数中访问。
/// 要解决这个问题，可以将 x 定义为全局变量或者将 define_x 函数修改为返回 x 的值。
fn practice4() {
    println!("{}, world", define_x()); 
}

fn define_x()-> &'static str {
    let x = "hello";
    x
}

/// 返回字面值常量时
/// 结论:当函数或者结构体出现借用时，必须指定生命周期参数，以确保返回的引用在调用者使用时仍然有效。
fn define_x1<'a>() -> &'a str{
    "hello"
}

/// 结论:返回借用类型时，必须确保返回的引用在调用者使用时仍然有效。由于 String::from("hello") 
/// 创建了一个新的 String 对象，并且该对象在函数结束后会被销毁，因此返回一个指向该对象的引用是不安全的。
// fn define_x2<'a>()-> &'a str{
//     &String::from("hello")
// }
//------------------------------------------------------------------------------------

/// 若后面的变量声明的名称和之前的变量相同，则我们说：第一个变量被第二个同名变量遮蔽了( shadowing )
fn practice5() {
    let x: i32 = 5;
    {
        let x = 12;
        assert_eq!(x, 12); 
        // assert_eq!(x, 5); 
        //运行到此时是错误的，因为在这个作用域内，x 被重新声明并赋值为 12，所以 x 的值是 12，而不是 5。
    }
    assert_eq!(x, 5);
    // assert_eq!(x, 12);
    //运行到此时也是错误的，因为在外部作用域内，x 的值仍然是 5，而不是 12。

    let x = 42;
    println!("{}", x); // 输出 "42"
}
//------------------------------------------------------------------------------------
/// 修改一行代码以通过编译
fn practice6() {
    let mut x: i32 = 1;
    x = 7;
    // 遮蔽且再次绑定
    let mut x = x; 
    // let x = x; 原始内容
    x += 3;


    let y = 4;
    // 遮蔽
    let y = "I can also be bound to text!"; 
}
//------------------------------------------------------------------------------------

/// - 🌟  一种方法
/// - 🌟🌟  两种方法
/// 
/// > 注意: 你可以使用两种方法解决，但是它们没有一种是移除 `let x = 1` 所在的代码行
/// 
/// ```rust,editable
/// 
/// fn main() {
///     let x = 1; 
/// }
/// 
/// 结论: 1. 使用 #[allow(unused_variables)] 属性来允许未使用的变量。
#[allow(unused_variables)]
fn practice7_1()
{
    let x = 1;
}

///结论: 2. 使用下划线 `_` 来表示未使用的变量。
fn practice7_2()
{
    let _x = 1;
}

//------------------------------------------------------------------------------------

/// 8. 🌟🌟 我们可以将 `let` 跟一个模式一起使用来解构一个元组，最终将它解构为多个独立的变量
/// 
/// > 提示: 可以使用变量遮蔽或可变性
/// 
/// ```rust,editable
/// // 修复下面代码的错误并尽可能少的修改
/// fn main() {
///     let (x, y) = (1, 2);
///     x += 2;
/// 
///     assert_eq!(x, 3);
///     assert_eq!(y, 2);
/// }
/// ```
/// 结论: 1. 使用可变性来修改变量 x 的值。
fn practice8_1() {
    let (mut x,y) = (1, 2);
    x += 2;
    assert_eq!(x, 3);
    assert_eq!(y, 2);
}

/// 结论: 2. 使用变量遮蔽来重新绑定变量 x 的值。
fn practice8_2() {
    let (x, y) = (1, 2);
    let x = 3;
    assert_eq!(x, 3);
    assert_eq!(y, 2);
}

//------------------------------------------------------------------------------------

/// ### 解构式赋值
/// 该功能于 Rust 1.59 版本引入：你可以在赋值语句的左式中使用元组、切片或结构体进行匹配赋值。
/// 9. 🌟🌟
/// > Note: 解构式赋值只能在 Rust 1.59 或者更高版本中使用
/// ```rust,editable
/// fn main() {
///     let (x, y);
///     (x,..) = (3, 4);
///     [.., y] = [1, 2];
///     // 填空，让代码工作
///     assert_eq!([x,y], __);
/// } 
/// 
/// 结论： 1. 使用解构式赋值来将元组 (3, 4) 中的第一个元素赋值给变量 x，并将切片 [1, 2] 中的最后一个元素赋值给变量 y。
/// 结论:  元组()可以包含不同的数据类型,[]只能包含同一类型
fn practice9() {
    let (x, y);
    (x,..) = (3, 4);
    [.., y] = [1, 2];
    // 填空，让代码工作
    assert_eq!([x,y], [3,2]);

    let (x1,x2,x3);
    (x1, x2, x3) = (5, 6.0, "dawdaw"); //支持不同的类型
    // [x1,x2,x3] = [5, 6.0, "dawdaw"]; //不支持不同的类型
}

fn main()
{
    practice9();
}

